In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

plt.style.use('ggplot')

In [22]:
#collecting data

employees_df = pd.read_csv('data/employee_data.csv', parse_dates=True)
engagement_survey_df = pd.read_csv('data/employee_engagement_survey_data.csv', parse_dates=True)
recruitment_df = pd.read_csv('data/recruitment_data.csv', parse_dates=True)
training_dev_df = pd.read_csv('data/training_and_development_data.csv', parse_dates=True)

In [24]:
employees_df_dates = [var for var in employees_df.columns if 'DATE' in var.upper()]
engagement_survey_df =

In [28]:
for df in [employees_df, engagement_survey_df, recruitment_df, training_dev_df]:
    cols = [var for var in df.columns if 'DATE' in var.upper()]
    df.loc[:, cols] = df.loc[:, cols].apply(pd.to_datetime)

C:\Users\obaliuta\AppData\Local\Temp\ipykernel_12980\2303135823.py:3: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df.loc[:, cols] = df.loc[:, cols].apply(pd.to_datetime)
C:\Users\obaliuta\AppData\Local\Temp\ipykernel_12980\2303135823.py:3: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df.loc[:, cols] = df.loc[:, cols].apply(pd.to_datetime)
C:\Users\obaliuta\AppData\Local\Temp\ipykernel_12980\2303135823.py:3: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df.loc[:, cols] = df.loc[:, cols].apply(pd.to_datetime)
C:\Users\obaliuta\AppData\Local\Temp\ipykernel_12980\2303135823.py:3: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df.loc[:, cols] = df.loc[:, cols].apply(pd.to_datetime)
C:\Users\obaliuta\AppData\Local\Temp\ipykernel_12980\2303135823.py:3: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df.loc[:, cols] = df.loc[:, cols].apply(pd.to_datetime)
C:\Users\obaliuta\AppData\Local\Temp\ipykernel_12980\2303135823.py:3: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df.loc[:, cols] = df.loc[:, cols].apply(pd.to_datetime)

In [29]:
for df in [employees_df, engagement_survey_df, recruitment_df, training_dev_df]:
    display(df.head(5))
    print(df.columns)
    print(df.shape)
    display(df.info())

,EmpID,FirstName,LastName,StartDate,ExitDate,Title,Supervisor,ADEmail,BusinessUnit,EmployeeStatus,...,Division,DOB,State,JobFunctionDescription,GenderCode,LocationCode,RaceDesc,MaritalDesc,Performance Score,Current Employee Rating
0,3427,Uriah,Bridges,2019-09-20,NaT,Production Technician I,Peter Oneill,uriah.bridges@bilearner.com,CCDR,Active,...,Finance & Accounting,07-10-1969,MA,Accounting,Female,34904,White,Widowed,Fully Meets,4
1,3428,Paula,Small,2023-02-11,NaT,Production Technician I,Renee Mccormick,paula.small@bilearner.com,EW,Active,...,Aerial,30-08-1965,MA,Labor,Male,6593,Hispanic,Widowed,Fully Meets,3
2,3429,Edward,Buck,2018-12-10,NaT,Area Sales Manager,Crystal Walker,edward.buck@bilearner.com,PL,Active,...,General - Sga,06-10-1991,MA,Assistant,Male,2330,Hispanic,Widowed,Fully Meets,4
3,3430,Michael,Riordan,2021-06-21,NaT,Area Sales Manager,Rebekah Wright,michael.riordan@bilearner.com,CCDR,Active,...,Finance & Accounting,04-04-1998,ND,Clerk,Male,58782,Other,Single,Fully Meets,2
4,3431,Jasmine,Onque,2019-06-29,NaT,Area Sales Manager,Jason Kim,jasmine.onque@bilearner.com,TNS,Active,...,General - Con,29-08-1969,FL,Laborer,Female,33174,Other,Married,Fully Meets,3

Index(['EmpID', 'FirstName', 'LastName', 'StartDate', 'ExitDate', 'Title',
       'Supervisor', 'ADEmail', 'BusinessUnit', 'EmployeeStatus',
       'EmployeeType', 'PayZone', 'EmployeeClassificationType',
       'TerminationType', 'TerminationDescription', 'DepartmentType',
       'Division', 'DOB', 'State', 'JobFunctionDescription', 'GenderCode',
       'LocationCode', 'RaceDesc', 'MaritalDesc', 'Performance Score',
       'Current Employee Rating'],
      dtype='object')
(3000, 26)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 26 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   EmpID                       3000 non-null   int64
 1   FirstName                   3000 non-null   object
 2   LastName                    3000 non-null   object
 3   StartDate                   3000 non-null   datetime64[ns]
 4   ExitDate                    1533 non-null   datetime64[ns]
 5   Title                       3000 non-null   object
 6   Supervisor                  3000 non-null   object
 7   ADEmail                     3000 non-null   object
 8   BusinessUnit                3000 non-null   object
 9   EmployeeStatus              3000 non-null   object
 10  EmployeeType                3000 non-null   object
 11  PayZone                     3000 non-null   object
 12  EmployeeClassificationType  3000 non-null   object
 13  TerminationType             3000 non-null   object
 14  TerminationDescription      1533 non-null   object
 15  DepartmentType              3000 non-null   object
 16  Division                    3000 non-null   object
 17  DOB                         3000 non-null   object
 18  State                       3000 non-null   object
 19  JobFunctionDescription      3000 non-null   object
 20  GenderCode                  3000 non-null   object
 21  LocationCode                3000 non-null   int64
 22  RaceDesc                    3000 non-null   object
 23  MaritalDesc                 3000 non-null   object
 24  Performance Score           3000 non-null   object
 25  Current Employee Rating     3000 non-null   int64
dtypes: datetime64[ns](2), int64(3), object(21)
memory usage: 609.5+ KB

None

,Employee ID,Survey Date,Engagement Score,Satisfaction Score,Work-Life Balance Score
0,1001,2022-10-10,2,5,5
1,1002,2023-03-08,4,5,3
2,1003,2023-03-01,2,5,2
3,1004,2023-07-30,3,5,3
4,1005,2023-06-19,2,4,5

Index(['Employee ID', 'Survey Date', 'Engagement Score', 'Satisfaction Score',
       'Work-Life Balance Score'],
      dtype='object')
(3000, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Employee ID              3000 non-null   int64
 1   Survey Date              3000 non-null   datetime64[ns]
 2   Engagement Score         3000 non-null   int64
 3   Satisfaction Score       3000 non-null   int64
 4   Work-Life Balance Score  3000 non-null   int64
dtypes: datetime64[ns](1), int64(4)
memory usage: 117.3 KB

None

,Applicant ID,Application Date,First Name,Last Name,Gender,Date of Birth,Phone Number,Email,Address,City,State,Zip Code,Country,Education Level,Years of Experience,Desired Salary,Job Title,Status
0,1001,2023-06-03,Scott,Sheppard,Male,1992-08-31,421-429-7655x39421,perezjanet@example.org,597 Smith Point,Hollandfort,NV,57588,Micronesia,High School,8,60103.21,Chief Technology Officer,Interviewing
1,1002,2023-05-15,Stanley,Lewis,Male,1965-04-29,+1-451-574-5308x1681,grossmark@example.com,8116 Stuart Loop,Port Margaretfurt,TN,14726,Greenland,Bachelor's Degree,17,64575.84,"Designer, furniture",Rejected
2,1003,2023-08-04,Javier,Li,Female,1973-10-03,(858)901-5499,katiemaldonado@example.com,5940 Barr Villages Suite 075,Dianaland,TX,4699,China,PhD,20,39422.71,"Sound technician, broadcasting/film/video",Rejected
3,1004,2023-07-28,Christopher,Johnston,Other,2001-04-04,(853)681-1839x2010,sheila73@example.com,442 Lewis Mount,Youngfurt,GA,34455,Ghana,High School,8,51045.11,Air cabin crew,Rejected
4,1005,2023-06-05,Melissa,Hicks,Other,1978-06-17,364-575-8478x67812,emilypatterson@example.org,95961 Taylor Circles Apt. 169,East Ashleyborough,IN,21014,Solomon Islands,Master's Degree,0,52792.86,Art therapist,Interviewing

Index(['Applicant ID', 'Application Date', 'First Name', 'Last Name', 'Gender',
       'Date of Birth', 'Phone Number', 'Email', 'Address', 'City', 'State',
       'Zip Code', 'Country', 'Education Level', 'Years of Experience',
       'Desired Salary', 'Job Title', 'Status'],
      dtype='object')
(3000, 18)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Applicant ID         3000 non-null   int64
 1   Application Date     3000 non-null   datetime64[ns]
 2   First Name           3000 non-null   object
 3   Last Name            3000 non-null   object
 4   Gender               3000 non-null   object
 5   Date of Birth        3000 non-null   datetime64[ns]
 6   Phone Number         3000 non-null   object
 7   Email                3000 non-null   object
 8   Address              3000 non-null   object
 9   City                 3000 non-null   object
 10  State                3000 non-null   object
 11  Zip Code             3000 non-null   int64
 12  Country              3000 non-null   object
 13  Education Level      3000 non-null   object
 14  Years of Experience  3000 non-null   int64
 15  Desired Salary       3000 non-null   float64
 16  Job Title            3000 non-null   object
 17  Status               3000 non-null   object
dtypes: datetime64[ns](2), float64(1), int64(3), object(12)
memory usage: 422.0+ KB

None

,Employee ID,Training Date,Training Program Name,Training Type,Training Outcome,Location,Trainer,Training Duration(Days),Training Cost
0,1001,2022-09-21,Customer Service,Internal,Failed,Port Greg,Amanda Daniels,4,510.83
1,1002,2023-07-19,Leadership Development,Internal,Failed,Brandonview,Brittany Chambers,2,582.37
2,1003,2023-02-24,Technical Skills,Internal,Incomplete,Port Briannahaven,Mark Roberson,4,777.06
3,1004,2023-01-12,Customer Service,Internal,Completed,Knightborough,Richard Fisher,2,824.30
4,1005,2023-05-12,Communication Skills,External,Passed,Bruceshire,Heather Shaffer,4,145.99

Index(['Employee ID', 'Training Date', 'Training Program Name',
       'Training Type', 'Training Outcome', 'Location', 'Trainer',
       'Training Duration(Days)', 'Training Cost'],
      dtype='object')
(3000, 9)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Employee ID              3000 non-null   int64
 1   Training Date            3000 non-null   datetime64[ns]
 2   Training Program Name    3000 non-null   object
 3   Training Type            3000 non-null   object
 4   Training Outcome         3000 non-null   object
 5   Location                 3000 non-null   object
 6   Trainer                  3000 non-null   object
 7   Training Duration(Days)  3000 non-null   int64
 8   Training Cost            3000 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(5)
memory usage: 211.1+ KB

None